/******************************************************************
 ** Copyright (C),  CVTE Electronics CO.Ltd 2020-2021.
 ** File name:
 ** Author:         sulikang
 ** Version:        V0.0.1
 ** Date:           2021-3-25
 ** Description:
 ** Others:
 ** Function List:
 ** History:        2021-03 sulikang 创建
 ** <time>          <author>    <version >    <desc>
 ** 2021-3-25       sulikang    0.0.1         创建文件
 ******************************************************************/
#ifndef _DRV_SOFT_I2C_H
#define _DRV_SOFT_I2C_H

/*****************************************************************
 * 包含头文件
 ******************************************************************/
#include "typedef.h"

/*****************************************************************
 * 宏定义
 ******************************************************************/

/**
 * @ingroup DRV_SOFT_I2C
 *
 * @brief \n
 * \n
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************
 * 结构定义
 ******************************************************************/

/*****************************************************************
 * 全局变量声明
 ******************************************************************/

/*****************************************************************
 * 函数原型声明
 ******************************************************************/

/*****************************************************************
功  能: 初始化 drv_soft_i2c
返回值: 等于0表示成功，其它值表示失败原因
 *****************************************************************/
int drv_soft_i2c_init(void);

/*****************************************************************
功  能: 释放 drv_soft_i2c 资源
返回值: 等于0表示成功，其它值表示失败原因
******************************************************************/
int drv_soft_i2c_deInit(void);

// IIC所有操作函数
void IIC_Init(void);                    //初始化IIC的IO口
void IIC_Start(void);                   //发送IIC开始信号
void IIC_Stop(void);                    //发送IIC停止信号
void IIC_Send_Byte(u8 txd);             // IIC发送一个字节
u8   IIC_Read_Byte(unsigned char ack);  // IIC读取一个字节
u8   IIC_Wait_Ack(void);                // IIC等待ACK信号
void IIC_Ack(void);                     // IIC发送ACK信号
void IIC_NAck(void);                    // IIC不发送ACK信号

void IIC_Write_One_Byte(u8 daddr, u8 addr, u8 data);
u8   IIC_Read_One_Byte(u8 daddr, u8 addr);
/*****************************************************************
 * 函数说明
 ******************************************************************/

#ifdef __cplusplus
}
#endif

/* @} DRV_SOFT_I2C */

#endif
