/*************************************************
  ** Copyright (C),  CVTE Electronics CO.Ltd 2020-2021.
  ** File name:      fal.h
  ** Author:
  ** Version:
  ** Date:
  ** Description:
  ** Others:
  ** Function List:
  ** History:

  ** <time>   <author>    <version >   <desc>
  **
*************************************************/

#ifndef _FAL_CLIFF_H
#define _FAL_CLIFF_H

/*****************************************************************
 * 包含头文件(如非特殊需要，H文件不建议包含其它H文件)
 ******************************************************************/
#include "stdint.h"
#include "lwrb.h"
#include "cmsis_os.h"

/**
 * @ingroup FAL_CLIFF 功能适配层
 *
 * @brief \n
 * \n
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************
 * 宏定义
 ******************************************************************/

/*****************************************************************
 * 结构定义
 ******************************************************************/
#pragma pack(push)
#pragma pack(1)
typedef struct {
    uint8_t  header0;
    uint8_t  header1;
    uint16_t dist;  ///< 距离/cm
    uint16_t amp;   ///< 信号强度，小于 100 时测距结果不可靠，过曝时数值为 65535。
    uint16_t temp;  ///< Temp / 8 – 256 = ℃
    uint8_t  checksum;

} CLIFF_FRMAE_DATA_T, *CLIFF_FRMAE_DATA_P;

#pragma pack(pop)

/*****************************************************************
 * 全局变量声明
 ******************************************************************/
extern lwrb_t cliff_rbuff;

/*****************************************************************
 * 函数原型声明
 ******************************************************************/

/****************************************************
功能  : 初始化 fal_cliff_init
返回值: 等于0表示成功，其它值表示失败原因
 ***************************************************/
int fal_cliff_init(void);

/****************************************************
功能  ：释放 fal_security_mng 资源
返回值：等于0表示成功，其它值表示失败原因
***************************************************/
int fal_cliff_deInit(void);

/*****************************************************************
 * 函数说明
 ******************************************************************/

#ifdef __cplusplus
}
#endif

/* @} FAL_CLIFF */

#endif
