/*************************************************
  ** Copyright (C),  CVTE Electronics CO.Ltd 2020-2021.
  ** File name:      fal.h
  ** Author:
  ** Version:
  ** Date:
  ** Description:
  ** Others:
  ** Function List:
  ** History:

  ** <time>   <author>    <version >   <desc>
  **
*************************************************/

#ifndef _FAL_DISPLAY_H
#define _FAL_DISPLAY_H

/*****************************************************************
 * 包含头文件(如非特殊需要，H文件不建议包含其它H文件)
 ******************************************************************/
#include "stdint.h"

/**
 * @ingroup FAL_DISPLAY
 *
 * @brief \n
 * \n
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************
 * 宏定义
 ******************************************************************/

/*****************************************************************
 * 结构定义
 ******************************************************************/
#pragma pack(push)
#pragma pack(1)
typedef struct {
    uint16_t display_mode;
    uint16_t hundred;
    uint16_t ten;
    uint16_t single;

} DISPLAY_CMD_T, *DISPLAY_CMD_P;
#pragma pack(pop)

/*****************************************************************
 * 全局变量声明
 ******************************************************************/

/*****************************************************************
 * 函数原型声明
 ******************************************************************/
uint8_t display_set_battery_percent(uint8_t charge_sta, uint8_t val);
uint8_t display_set_error_code(uint8_t val);

/****************************************************
功能  : 初始化FAL层
返回值:等于0表示成功，其它值表示失败原因
 ***************************************************/
int fal_display_init(void);

/****************************************************
功能  : 释放FAL层资源
返回值: 等于0表示成功，其它值表示失败原因
***************************************************/
int fal_display_deInit(void);

/*****************************************************************
 * 函数说明
 ******************************************************************/

#ifdef __cplusplus
}
#endif

/* @} Robot_FAL */

#endif
