/*************************************************
  ** Copyright (C),  CVTE Electronics CO.Ltd 2020-2021.
  ** File name:      fal.h
  ** Author:
  ** Version:
  ** Date:
  ** Description:
  ** Others:
  ** Function List:
  ** History:

  ** <time>   <author>    <version >   <desc>
  **
*************************************************/

#ifndef _FAL_PMU_H
#define _FAL_PMU_H

/*****************************************************************
 * 包含头文件(如非特殊需要，H文件不建议包含其它H文件)
 ******************************************************************/
#include "stdint.h"

/**
 * @ingroup FAL_PMU 电源管理功能
 *
 * @brief \n
 * \n
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************
 * 宏定义
 ******************************************************************/
#define NVG_SOC_UP_CMD   (0X01)
#define NVG_SOC_DOWN_CMD (0X02)

/*****************************************************************
 * 结构定义
 ******************************************************************/
typedef enum {
    PMU_STA_STANDBY,   ///< 待机
    PMU_STA_STARTING,  ///< 启动中
    PMU_STA_RUNNING,   ///< 运行中
    PMU_STA_SHUTDOWN   ///< 关机中

} PMU_STA_E;

typedef enum {
    SOC_STA_POWEROFF = 0x00,  ///< 断电
    SOC_STA_STANDBY  = 0x01,  ///< 待机
    SOC_STA_STARTING = 0x03,  ///< 启动中
    SOC_STA_RUNNING  = 0x02,  ///< 运行中
    SOC_STA_SHUTDOWN = 0x04   ///< 关机中

} SOC_STA_E;

/*****************************************************************
 * 全局变量声明
 ******************************************************************/

/*****************************************************************
 * 函数原型声明
 ******************************************************************/

/****************************************************
功能  : 初始化 fal_pmu
返回值: 等于0表示成功，其它值表示失败原因
 ***************************************************/
int fal_pmu_init(void);

/****************************************************
功能  ：释放 fal_pmu 资源
返回值：等于0表示成功，其它值表示失败原因
***************************************************/
int fal_pmu_deInit(void);

void      fal_pmu_set_sta(PMU_STA_E sta);
PMU_STA_E fal_pmu_get_sta(void);

uint32_t fal_pmu_sys_up_time(void);
uint32_t fal_pmu_sys_down_time(void);

/*****************************************************************
 * 函数说明
 ******************************************************************/

#ifdef __cplusplus
}
#endif

/* @} FAL_PMU */

#endif
