/******************************************************************
 ** Copyright (C),  CVTE Electronics CO.Ltd 2020-2021.
 ** File name:
 ** Author:         sulikang
 ** Version:        V0.0.1
 ** Date:           2021-3-25
 ** Description:
 ** Others:
 ** Function List:
 ** History:        2021-03 sulikang 创建
 ** <time>          <author>    <version >    <desc>
 ** 2021-3-25       sulikang    0.0.1         创建文件
 ******************************************************************/
#ifndef _BSP_EEPROM_H
#define _BSP_EEPROM_H
#include "typedef.h"

/*****************************************************************
 * 包含头文件
 ******************************************************************/

/*****************************************************************
 * 宏定义
 ******************************************************************/

/**
 * @ingroup BSP_EEPROM
 *
 * @brief \n
 * \n
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************
 * 结构定义
 ******************************************************************/

/*****************************************************************
 * 全局变量声明
 ******************************************************************/

/*****************************************************************
 * 函数原型声明
 ******************************************************************/

/*****************************************************************
功  能: 初始化 bsp_eeprom
返回值: 等于0表示成功，其它值表示失败原因
 *****************************************************************/
int bsp_eeprom_init(void);

/*****************************************************************
功  能: 释放 bsp_eeprom 资源
返回值: 等于0表示成功，其它值表示失败原因
******************************************************************/
int bsp_eeprom_deInit(void);

u8   AT24CXX_ReadOneByte(u16 ReadAddr);  //指定地址读取一个字节
void AT24CXX_WriteOneByte(u16 WriteAddr,
                          u8  DataToWrite);  //指定地址写入一个字节
void AT24CXX_WriteLenByte(u16 WriteAddr, u32 DataToWrite,
                          u8 Len);               //指定地址开始写入指定长度的数据
u32  AT24CXX_ReadLenByte(u16 ReadAddr, u8 Len);  //指定地址开始读取指定长度数据
void AT24CXX_Write(u16 WriteAddr, u8 *pBuffer,
                   u16 NumToWrite);  //从指定地址开始写入指定长度的数据
void AT24CXX_Read(u16 ReadAddr, u8 *pBuffer,
                  u16 NumToRead);  //从指定地址开始读出指定长度的数据

void BL24C16_Write(u16 WriteAddr, u8 *pBuffer,
                   u16 NumToWrite);  //从指定地址开始写入指定长度的数据
void BL24C16_Read(u16 ReadAddr, u8 *pBuffer,
                  u16 NumToRead);  //从指定地址开始读出指定长度的数据

/*****************************************************************
 * 函数说明
 ******************************************************************/

#ifdef __cplusplus
}
#endif

/* @} BSP_EEPROM */

#endif
